Autodesk.Revit.DB.SunStudyTimeInterval
Time interval enum for a single or multi-day sun study.
Since:
2011
Enum of sun study time interval.
Since:
2011

Autodesk.Revit.DB.SunStudyTimeInterval.Month
Interval occurs once a month.

Autodesk.Revit.DB.SunStudyTimeInterval.Week
Interval occurs once a week.

Autodesk.Revit.DB.SunStudyTimeInterval.Day
Interval occurs every day.

Autodesk.Revit.DB.SunStudyTimeInterval.Hour
Interval occurs every hour.

Autodesk.Revit.DB.SunStudyTimeInterval.Minutes45
Interval occurs every 45 minutes.

Autodesk.Revit.DB.SunStudyTimeInterval.Minutes30
Interval occurs every 30 minutes.

Autodesk.Revit.DB.SunStudyTimeInterval.Minutes15
Interval occurs every 15 minutes.